codinghead/cbuff-module/cbuffTest/cbuff_PIC32_C32_test/circBufferPIC32Test.c
/*******************************************************************************
*
* CIRCULAR BUFFER TEST PROGRAM
*
*******************************************************************************/

/*******************************************************************************
*
* Tests the circular buffer module's functionality
*
* Filename : circBufferTest.c
* Version : V0.01
* Programmer(s) : Suart Cording aka CODINGHEAD 
* 
********************************************************************************
* Note(s) : 
* V0.01 - 4th June 2010 - branch to figure out why code doesn't work on PIC32
*******************************************************************************/

/*******************************************************************************
* Commenting notes
* ???? Question(s) regarding implementation or design specification.
* $$$$ Future function that needs to be implemented.
* @@@@ Old code to leave as-is because ....
* #### Technical issue not (satisfactorily) resolved.
*******************************************************************************/

/*******************************************************************************
*
*                           CIRCULAR BUFFER TEST PROGRAM
*
*******************************************************************************/


/*******************************************************************************
*                                 INCLUDE FILES
*******************************************************************************/

                            /* HI-TECH PICC / PICC-Lite compiler */
#if	defined(__PICC__) || defined(__PICCLITE__)
    // PIC16 processor
    #include <pic.h>
#elif	defined(__PICC18__) /* HI-TECH PICC-18 compiler */
    // PIC18 processor
    #include <pic18.h>
#elif	defined(__DSPICC__) /* HI-TECH dsPICC compiler */
    // dsPIC or PIC24 processor
    #include <dspic.h>
#elif defined(__PICC32__)   /* HI-TECH C for PIC32 */
    #include <pic32.h>
#elif defined(__18CXX)      /* Microchip C18 compiler */
    // PIC18 processor
    #include <p18cxxx.h>
#elif defined(__PIC24F__)	/* Microchip C30 compiler */
	// PIC24F processor
	#include <p24Fxxxx.h>
#elif defined(__PIC24H__)	/* Microchip C30 compiler */
	// PIC24H processor
	#include <p24Hxxxx.h>
#elif defined(__dsPIC33F__)	/* Microchip C30 compiler */
	// dsPIC33F processor
	#include <p33Fxxxx.h>
#elif defined(__dsPIC30F__)	/* Microchip C30 compiler */
	// dsPIC30F processor
	#include <p30fxxxx.h>
#elif defined(__PIC32MX__)	/* Microchip C32 compiler */
	#include <p32xxxx.h>
	#include <plib.h>
	#pragma config POSCMOD=XT, FNOSC=PRIPLL
	#pragma config FPLLIDIV=DIV_2, FPLLMUL=MUL_20, FPLLODIV=DIV_1
	#pragma config FPBDIV=DIV_2, FWDTEN=OFF, CP=OFF, BWP=OFF
#else
	#error Unknown processor or compiler.
#endif

#include <stdio.h>
#include "..\cbuff_module\cbuff.h"

/*******************************************************************************
*                                 LOCAL DEFINES
*******************************************************************************/
#define INBUFFERSIZE        64
#define OUTBUFFERSIZE       32
#define TESTBUFFER1SIZE     8
#define TESTBUFFER2SIZE     16

/*******************************************************************************
*                                LOCAL CONSTANTS
*******************************************************************************/


/*******************************************************************************
*                                LOCAL DATA TYPES
*******************************************************************************/


/*******************************************************************************
*                                  LOCAL TABLES
*******************************************************************************/


/*******************************************************************************
*                             LOCAL GLOBAL VARIABLES
*******************************************************************************/

static unsigned char        dummyDeclaration;
                                        /* dummyDeclaration ensures that the  */
                                        /* first byte of inBuffer is assigned */
                                        /* to address 0 on PIC18 in ExtMode   */
                                        /* Would otherwise cause failure      */
                                        /* during allocation of inBuffer      */
                                        /* in Test 2                          */
static CBUFF            	inBuffer[INBUFFERSIZE];
static CBUFF            	outBuffer[OUTBUFFERSIZE];
static CBUFF            	testBuffer1[TESTBUFFER1SIZE];
static CBUFF            	testBuffer2[TESTBUFFER2SIZE];
static CBUFFOBJ		    	inBufferObj;
static CBUFFOBJ		    	outBufferObj;
static CBUFFOBJ		    	testBuffer1Obj;
static CBUFFOBJ		    	testBuffer2Obj;


/*******************************************************************************
*                             LOCAL FUNCTION PROTOTYPES
*******************************************************************************/


/*******************************************************************************
*                            LOCAL CONFIGURATION ERRORS
*******************************************************************************/


/*******************************************************************************
* main()
*
* Description: 
*   Main application code
*
* See also:
*
* Arguments: 
*   void
*
* Returns: 
*   void
*
* Callers: C start-up code
*
* Notes : 
*
*******************************************************************************/
#if	defined(__18CXX)
void main (void)
#else
int main(void)
#endif
{
    CBUFF            writeData = 0;
    CBUFF            readData = 0;
    //unsigned char       isBufferGood = 0;
    unsigned char       x;              /* used for 'for' loops               */
    unsigned int        spaceRemainingInBuffer = 0;
    unsigned int        dataInBuffer = 0;
    CBUFFNUM			inBufferNum;
    CBUFFNUM			outBufferNum;
    CBUFFNUM			testBuffer1Num;
    CBUFFNUM			testBuffer2Num;
    HCBUFF           hInBuffer;
    HCBUFF           hOutBuffer;
    HCBUFF           hDummyHandle;
                                        /* Initialise buffer module           */
    cbuffInit();
    
    /***************************************************************************
    * TEST 1 - Try to create some buffer objects without passing the correct
    *          parameters. Each attempt should fail
    ***************************************************************************/
    inBufferNum = cbuffCreate((CBUFF *) 0, INBUFFERSIZE, &inBufferObj);
    
    outBufferNum = cbuffCreate(outBuffer, 0, &outBufferObj);
    
    testBuffer1Num = cbuffCreate(testBuffer1, TESTBUFFER1SIZE, 
    								 (CBUFFOBJ *) 0);
    								 
