codinghead/cbuff-module/cbuffTest/cbuff_PIC32_C32_test/circBufferPIC32Test.c
    /* Put new data in array */
    for(x = 0; x < 16; x++)
    {
        testBuffer2[x] = x + 'A';
    }    
    /* Put some data from array in the buffer */
    dataInBuffer = cbuffPutArray(hOutBuffer, testBuffer2, 8);
    /* Clear local array */
    for(x = 0; x < 16; x++)
    {
        testBuffer2[x] = 0;
    }
    /* Try to read more that is there */
    dataInBuffer = cbuffGetArray(hOutBuffer, testBuffer2, 16);
    if (dataInBuffer != 8)
    {
        /* ERROR - read more/less data than in buffer - should only have read */
        /*         8 bytes                                                    */
        while(1);
    }    
    
    /***************************************************************************
    * TEST 26 - Try to read circular buffer into array over buffer boundary
    ***************************************************************************/
    /* Empty buffer */
    cbuffClearBuffer(hOutBuffer);
    
    /* Put new data in array */
    for(x = 0; x < 16; x++)
    {
        testBuffer2[x] = x + '0';
    }    
    /* Put some data in the buffer with data from array */
    dataInBuffer = cbuffPutArray(hOutBuffer, testBuffer2, 16);
    dataInBuffer = cbuffPutArray(hOutBuffer, testBuffer2, 8);
    /* Read the some data out */
    dataInBuffer = cbuffGetArray(hOutBuffer, testBuffer2, 16);
    dataInBuffer = cbuffGetArray(hOutBuffer, testBuffer2, 8);
    /* Put some more data in the buffer, writing over buffer boundary */
    dataInBuffer = cbuffPutArray(hOutBuffer, testBuffer2, 16);
    /* Clear local array */
    for(x = 0; x < 16; x++)
    {
        testBuffer2[x] = 0;
    }
    /* Read out over the boundary into the array */
    dataInBuffer = cbuffGetArray(hOutBuffer, testBuffer2, 16);
    if (dataInBuffer != 16)
    {
        /* ERROR - didn't read 16 bytes from buffer */
        while(1);
    }
    /* Check what we read is correct */
    for(x = 0; x < 16; x++)
    {
        if (testBuffer2[x] != x + '0')
        {
            /* ERROR - data read doesn't match data written */
            while(1);
        }    
    }
        
    /* Congratulations! If we stop here all tests passed */
    while (1);
}

/*******************************************************************************
*
*                           CIRCULAR BUFFER MODULE END
*
*******************************************************************************/
